# 완성형 웹, 앱 서비스를 각각 만들어서 출시, 마케팅, 수익화까지
# 인공지능이 보는 나의 동물상 테스트
# 동물상 대표 연예인들의 사진을 '머신러닝'을 통해 학습시킨 뒤
# e.g. 송중기 얼굴의 특징 -> 강아지 상으로 학습
# 내 사진을 업로드하면 어떤 동물상?
# 이 결과를 sns로 공유하게끔!
# 동물상 대표 연예인들의 사진을 모아보자 -> 크롤링 기술 사용

# 크롤링?
# 인터넷에 있는 정보 중 우리가 원하는 것만 골라서 자동으로 수집해주는 기술
# Crawling == Parsing == Scraping == Spidering
# 크롤링의 기초만 할 줄 알아도 실용적이고 재밌는 것들을 만들 수 있다

# 오늘의 식단 볼 수 있는 사이트
# 원하는 뉴스만 모아 볼 수 있는 서비스

# 크롤링의 원리?
# 우리가 정보를 가져오려는 사이트를 불러와서 우리가 원하는 정보를 찾고
# 그 정보를 가져오게 하는 코드를 짜면 된다

# 크롤링 관련 라이브러리는 보통 어느 언어에나 존재
# 파이썬으로 실습!

# 첫 번째 수업
# 텍스트 & 이미지 크롤링
# 1. 환경 설정(Python 개발 환경 설정 - 구름 IDE / 나는 vsc 그대로 사용)
# 2. 예제 무작정 실행하기(위키피디아 크롤링 예제)
# 3. 다른 작업에 응용하기(네이버 실시간 검색순위 크롤링하여 텍스트 저장)
# 4. 완전 쉬운 라이브러리 사용(동물상 연예인 사진 한 방에 크롤링)